/* Tool tip for the continue execution button */
"continueButtonToolTip" = "Continuar la ejecución";

/* Tool tip for the step into instruction button */
"stepIntoSegmentToolTip" = "Ejecutar un paso a la instrucción";

/* Tool tip for the step over instruction button */
"stepOverSegmentToolTip" = "Ejecutar un paso sobre la instrucción";

/* Tool tip for the step out of function button */
"stepOutSegmentToolTip" = "Ejecutar un paso hacia afuera de la función actual";

/* Labels 'Go to Call Address' menu item in Debug menu when using debugger, when a 'call' type instruction is selected */
"goToCallAddress" = "Ir a la dirección de llamada";

/* Labels 'Go to Branch Address' menu item in Debug menu when using debugger, when a 'jmp' type instruction is selected */
"goToBranchAddress" = "Ir a Dirección en Rama";

/* Labels 'Add Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoint change in Edit menu */
"addBreakpoint" = "Añadir Breakpoint";

/* Labels 'Add Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoints change in Edit menu */
"addBreakpoints" = "Añadir Breakpoints";

/* Labels 'Add Hardware Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoint" = "Añadir Hardware Breakpoint";

/* Labels 'Add Hardware Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoints" = "Añadir Hardware Breakpoints";

/* Labels 'Remove Breakpoint' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoint change in Edit menu */
"removeBreakpoint" = "Remover Breakpoint";

/* Labels 'Remove Breakpoints' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoints change in Edit menu */
"removeBreakpoints" = "Remover Breakpoints";

/* Labels 'NOP Instruction' menu item in Debug menu when using debugger */
"nopInstruction" = "NOP la instrucción";

/* Labels 'NOP Instructions' menu item in Debug menu when using debugger */
"nopInstructions" = "NOP las instrucciones";

/* Tooltip Label when mouse hovering over an instruction that has a breakpoint condition configured */
"breakpointConditionTooltipLabel" = "Condición del Breakpoint";

/* Tooltip Label for letting user know debugging intel code in Rosetta process is unsupported when mouse hovering over an instruction breakpoint column */
"breakpointIntelRosettaUnsupportedTooltipLabel" = "No se admite la depuración de código Intel en destinos Rosetta. Sin embargo, se admite la depuración del código ARM.";

/* Alert title that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertTitle" = "Error al modificar la instrucción";

/* Alert message that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertMessage" = "Se produjo un error al intentar ensamblar";

/* Alert title that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertTitle" = "Error al sobrescribir las instrucciones";

/* Alert message that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertMessage" = "Esta modificación excede el límite de las instrucciones que se muestran.";

/* Alert title that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertTitle" = "Sobrescribir instrucciones";

/* Alert message that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertMessageFormat" = "Esta modificación sobrescribirá %ld instrucciones. ¿Estás seguro de que quieres sobrescribirlas?";

/* Alert button that shows up when changing an instruction may require altering more than one instruction */
"overwrite" = "Sobrescribir";

/* Undo action for changing an instruction */
"undoInstructionChange" = "Cambio de instrucción";

/* Undo action for nopping an instruction */
"undoNOPChange" = "Cambio a NOP";

/* Alert title that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertTitle" = "Error al agregar Breakpoint";

/* Alert message that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertMessage" = "No se pudo agregar el breakpoint.";

/* Undo action for moving the instruction pointer */
"undoMoveInstructionPointer" = "Jump";

/* Notification title for when a breakpoint is hit */
"hitBreakpointNotificationTitle" = "Breakpoint activado!";

/* Notification message for when a breakpoint is hit */
"hitBreakpointNotificationMessage" = "Detenido en el Breakpoint";

/* Alert title for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertTitle" = "Expresión de Breakpoint no válida";

/* Alert message format for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertMessageFormat" = "Se produjo un error al intentar analizar la expresión '%@'";

/* Alert title for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertTitle" = "Error de evaluación de condición";

/* Alert message for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertMessage" = "\"%@\" no se pudo evaluar con la siguiente razón: %@. Compruebe los registros en el menú Depurar para obtener información detallada.";

/* Alert title for failing to step over an instruction */
"failedStepOverAlertTitle" = "Fallo del salto sobre la instrucción.";

/* Alert message for failing to step over an instruction */
"failedStepOverAlertMessage" = "Húbo un fallo al saltar por encima de la instrucción.";

/* Alert title for failing to step out */
"failedStepOutAlertTitle" = "Fallo del paso fuera de la instrucción.";

/* Alert message for failing to step out */
"failedStepOutAlertMessage" = "Hubo un fallo al intentar dar el paso fuera del procedimiento.";

/* Error indicating keystone engine could not be started (unlikely to occur) */
"failedAssembleWithStartingEngine" = "assembly engine no pudo comenzar con el error %u.";

/* Error indicating keystone engine could not assemble code */
"failedAssembleCode" = "no se pudo generar el código con el error %u.";

/* Error indicating current instructions could not be NOP'ed for code injection */
"failedNOPInstructionsForInjectingCode" = "No se ha podido NOP las instrucciones actuales.";

/* Error indicating code injection for rosetta is not supported */
"failedInjectCodeForRosetta" = "la inyección de código no es compatible con los objetivos de Rosetta";

/* Alert Title for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertTitle" = "Error al asignar (Allocate) memoria";

/* Alert Message for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertMessage" = "Se produjo un error al intentar asignar (Allocate) memoria nueva en el objetivo";

/* Alert Title for failing to inject code at the destination. Used in two places in code. */
"failedInjectCodeAlertTitle" = "No se pudo inyectar el código";

/* Alert Message for failing to inject code at the destination */
"failedInjectCodeAlertMessage" = "No había suficiente espacio para sobrescribir esta instrucción, o la dirección recién asignada estaba demasiado lejos.";

/* Message indicating where the new code will be inserted into */
"newlyCodeInjectedAtMessage" = "; Nuevo código será escrito en 0x%llX\n";

/* Message for assembling code failing when attemping to inject code. */
"failedAssemblingForInjectingCodeMessage" = "Se produjo un error al ensamblar el código nuevo";

/* Error indicating memory protection could not be changed for newly injected instructions */
"failedChangeMemoryProtectionForInjectingCode" = "no se pudo cambiar la protección de memoria en nuevas instrucciones";

